# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in this lab's data folder.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [176]:
# import libraries here
import pandas as pd
import numpy as np
from functools import reduce

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [9]:
# your code here
temp = pd.read_csv('../data/Temp_States.csv',';').drop(columns=['Unnamed: 3'])

#### Print `temp`.

In [10]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [12]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [0]:
"""
your comments here

We have 2 categorical data types and one numerical. 
"""

#### Select the rows where state is New York.

In [21]:
# your code here
temp[temp['State']=='New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [28]:
# your code here
temp[temp['State']=='New York'].mean()
#temp[temp['State']=='New York'].describe().loc['mean']

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [44]:
# your code here
list_states_above_15_c = list(temp[temp['Temperature']>15]['State'].unique())
list_cities_above_15_c = list(temp[temp['Temperature']>15]['City'].unique())
temp[temp['Temperature']>15][['State','City']]

         State      City
0     New York       NYC
3  Connecticut  Hartford
5   New Jersey    Treton
6   New Jersey    Newark

In [41]:
print(list_states_above_15_c,list_cities_above_15_c)

['New York', 'Connecticut', 'New Jersey'] ['NYC', 'Hartford', 'Treton', 'Newark']

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [45]:
temp[temp['Temperature']>15]['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

In [42]:
# your code here
list_cities_above_15_c = list(temp[temp['Temperature']>15]['City'].unique())
list_cities_above_15_c

['NYC', 'Hartford', 'Treton', 'Newark']

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [47]:
# your code here
mask =(temp['Temperature']>15) & (temp['Temperature']<20)
temp[mask]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [81]:
# your code here
temp.groupby(by=['State']).describe().T.loc['Temperature'].loc[['mean','std']]

State  Connecticut  New Jersey   New York
mean     15.833333   21.111111  10.740741
std       1.964186    1.571348   8.133404

In [82]:
temp.groupby(by=['State'])['Temperature'].agg(['mean','std']).T
#como trocar o nome das colunas agg

State  Connecticut  New Jersey   New York
mean     15.833333   21.111111  10.740741
std       1.964186    1.571348   8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [90]:
# your code here
employees = pd.read_csv('../data/employees.csv',';').drop(columns=['Unnamed: 7'])

#### Explore the data types of the `employees` dataframe. Comment your results.

In [92]:
# your code here
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [93]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [0]:
"""
your comments here

employees has 5 columns with categorical types of data and 2 columns with numerical. We have information about employees
"""

#### What's the average salary in this company?

In [98]:
# your code here
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [99]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [100]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [101]:
# your code here
mask = employees['Salary'] == employees['Salary'].min()

In [102]:
employees[mask]['Name']

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [103]:
# your code here
employees[employees['Name']=='David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [122]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [123]:
mask2 = employees['Education']=='Master'

In [128]:
employees.loc[mask2]
#loc mais eficiente em relação a mask sozinha. Primeiro faz o filtro na coluna e depois seleciona df todo
#com mask puro, carrega primeiro a base e depois filtra.

     Name Department Education Gender      Title  Years  Salary
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
4  Samuel      Sales    Master      M  associate      3      55
6  Carlos         IT    Master      M         VP      8      70
8     Ana         HR    Master      F         VP      8      70

In [109]:
# your code here
employees[employees['Name']=='David']['Salary']

2    30
Name: Salary, dtype: int64

In [121]:
employees[['Name','Salary']].set_index('Name').loc['David']

Salary    30
Name: David, dtype: int64

#### Print all the rows where job title is associate.

In [129]:
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [130]:
# your code here
mask3 = employees['Title']== 'associate'
employees.loc[mask3]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [131]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [133]:
# Method 2
# your code here
employees.iloc[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [134]:
# your code here
mask4 = (employees['Title']== 'associate') & (employees['Salary']>55)
employees[mask4]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [136]:
# your code here
employees.groupby(by='Years')['Salary'].mean()

Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

####  What is the average salary per title?

In [137]:
# your code here
employees.groupby(by='Title')['Salary'].mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [142]:
# your code here
employees['Salary'].quantile([0.25,0.5,0.75,1])

0.25    35.0
0.50    55.0
0.75    60.0
1.00    70.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [144]:
# your code here
employees.groupby(by='Gender')['Salary'].mean()
#yes

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [165]:
# your code here
employees.groupby(by='Department').describe()[['Years','Salary']]

           Years                                                Salary         \
           count      mean       std  min   25%  50%   75%  max  count   mean
Department
HR           3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0    3.0  45.00
IT           4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0    4.0  48.75
Sales        2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0    2.0  55.00


                  std   min    25%   50%   75%   max
Department
HR          21.794495  30.0  32.50  35.0  52.5  70.0
IT          19.311050  30.0  33.75  47.5  62.5  70.0
Sales        0.000000  55.0  55.00  55.0  55.0  55.0

In [163]:
employees.groupby(by='Department').agg({'mean','min','max'})

               Years         Salary
                mean min max   mean min max
Department
HR          4.666667   2   8  45.00  30  70
IT          4.500000   1   8  48.75  30  70
Sales       2.500000   2   3  55.00  55  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [206]:
# your code here
#nao consegui, perguntar depois!!!!!
employees.groupby(by='Department').agg({'Salary':['max','min']})

           Salary
              max min
Department
HR             70  30
IT             70  30
Sales          55  55

In [205]:
employees.groupby(by='Department').agg({'Salary':['max','min']})['Salary'].apply(lambda x: x['max'] - x['min'],axis=1)

Department
HR       40
IT       40
Sales     0
dtype: int64

In [207]:
employees.groupby(by='Department').agg({'Salary':['max']})['Salary']['max']-employees.groupby(by='Department').agg({'Salary':['min']})['Salary']['min']

Department
HR       40
IT       40
Sales     0
dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [216]:
# your code here
orders = pd.read_csv('../data/Orders.csv').drop(columns=['Unnamed: 0'])

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [221]:
# your code here
orders.dtypes.value_counts()

int64      7
object     4
float64    2
dtype: int64

In [222]:
orders.head(3)

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00

In [0]:
"""
your comments here

we have 7 columns with int values, 4 with object and 2 with float64    
"""

####  What is the average purchase price?

In [224]:
# your code here
orders['UnitPrice'].mean()

3.116174480549152

In [225]:
orders['purchase']=orders['Quantity']*orders['UnitPrice']

In [226]:
orders['purchase'].mean()

22.39474850474768

#### What are the highest and lowest purchase prices?

In [231]:
mask=orders['purchase']!=0

In [232]:
# your code here
orders[mask]['purchase'].describe()[['min','max']]

min         0.001
max    168469.600
Name: purchase, dtype: float64

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [239]:
orders.head(3)

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,purchase
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,Spain,15.30,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,Spain,20.34,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,Spain,22.00,22.00

In [243]:
# your code here
mask2 = orders['Country'] =='Spain'
orders[mask2]['CustomerID'].unique()

array([17850, 13047, 12583, ..., 13298, 14569, 12713], dtype=int64)

#### How many customers do we have in Spain?

In [244]:
# your code here
len(orders[mask2]['CustomerID'].unique())

4339

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [276]:
# your code here
mask3 = pd.DataFrame(orders['CustomerID'].value_counts()>50).reset_index()

mask5 =mask3['CustomerID']==True
list_customers_50_items = mask3[mask5]['index']



#como usar dessa outra forma:
#mask4 = 'CustomerID'].value_counts()>50)
#orders[mask2]['CustomerID'][orders[mask2][mask4]

#### Select orders from Spain that include more than 50 items.

In [286]:
orders.head(3)

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,purchase
0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,Spain,15.30,15.30
1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,Spain,20.34,20.34
2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,Spain,22.00,22.00

In [288]:
# your code here
mask6 = orders['Quantity']>50
orders[mask6][orders['Country']=='Spain']

C:\Users\User\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  This is separate from the ipykernel package so we can avoid doing imports until

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,purchase
46,536371,22086,2010,12,3,9,paper chain kit 50's christmas,80,2010-12-01 09:00:00,2.55,13748,Spain,204.00,204.00
83,536376,21733,2010,12,3,9,red hanging heart t-light holder,64,2010-12-01 09:32:00,2.55,15291,Spain,163.20,163.20
96,536378,21212,2010,12,3,9,pack of 72 retrospot cake cases,120,2010-12-01 09:37:00,0.42,14688,Spain,50.40,50.40
102,536378,85071B,2010,12,3,9,red charlie+lola personal doorsign,96,2010-12-01 09:37:00,0.38,14688,Spain,36.48,36.48
174,536386,85099C,2010,12,3,9,jumbo bag baroque black white,100,2010-12-01 09:57:00,1.65,16029,Spain,165.00,165.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397720,581566,23404,2011,12,5,11,home sweet home blackboard,144,2011-12-09 11:50:00,3.26,18102,Spain,469.44,469.44
397721,581567,21417,2011,12,5,11,cockle shell dish,84,2011-12-09 11:56:00,0.79,16626,Spain,66.36,66.36
397729,581567,21326,2011,12,5,11,aged glass silver t-light holder,144,2011-12-09 11:56:00,0.55,16626,Spain,79.20,79.20
397761,581571,23167,2011,12,5,12,small ceramic top storage jar,96,2011-12-09 12:00:00,0.69,15311,Spain,66.24,66.24
397882,581584,20832,2011,12,5,12,red flock love heart photo frame,72,2011-12-09 12:25:00,0.72,13777,Spain,51.84,51.84

#### Select all free orders.

In [289]:
# your code here
orders[orders['purchase']==0]

,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent,purchase
6914,537197,22841,2010,12,7,14,round cake tin vintage green,1,2010-12-05 14:02:00,0.0,12647,Spain,0.0,0.0
22539,539263,22580,2010,12,4,14,advent calendar gingham sack,4,2010-12-16 14:36:00,0.0,16560,Spain,0.0,0.0
25379,539722,22423,2010,12,2,13,regency cakestand 3 tier,10,2010-12-21 13:45:00,0.0,14911,Spain,0.0,0.0
29080,540372,22090,2011,1,4,16,paper bunting retrospot,24,2011-01-06 16:41:00,0.0,13081,Spain,0.0,0.0
29082,540372,22553,2011,1,4,16,plasters in tin skulls,24,2011-01-06 16:41:00,0.0,13081,Spain,0.0,0.0
34494,541109,22168,2011,1,4,15,organiser wood antique white,1,2011-01-13 15:10:00,0.0,15107,Spain,0.0,0.0
53788,543599,84535B,2011,2,4,13,fairy cakes notebook a6 size,16,2011-02-10 13:08:00,0.0,17560,Spain,0.0,0.0
85671,547417,22062,2011,3,3,10,ceramic bowl with love heart design,36,2011-03-23 10:25:00,0.0,13239,Spain,0.0,0.0
92875,548318,22055,2011,3,3,12,mini cake stand hanging strawbery,5,2011-03-30 12:45:00,0.0,13113,Spain,0.0,0.0
97430,548871,22162,2011,4,1,14,heart garland rustic padded,2,2011-04-04 14:42:00,0.0,14410,Spain,0.0,0.0
107192,550188,22636,2011,4,4,18,childs breakfast set circus parade,1,2011-04-14 18:57:00,0.0,12457,Spain,0.0,0.0
128641,553000,47566,2011,5,4,15,party bunting,4,2011-05-12 15:21:00,0.0,17667,Spain,0.0,0.0
137127,554037,22619,2011,5,5,14,set of 6 soldier skittles,80,2011-05-20 14:13:00,0.0,12415,Spain,0.0,0.0
194648,561284,22167,2011,7,2,12,oval wall mirror diamante,1,2011-07-26 12:24:00,0.0,16818,Spain,0.0,0.0
197173,561669,22960,2011,7,4,17,jam making set with jars,11,2011-07-28 17:09:00,0.0,12507,Spain,0.0,0.0
199711,561916,M,2011,8,1,11,manual,1,2011-08-01 11:44:00,0.0,15581,Spain,0.0,0.0
208950,562973,23157,2011,8,4,11,set of 6 nativity magnets,240,2011-08-11 11:42:00,0.0,14911,Spain,0.0,0.0
223931,564651,23270,2011,8,5,14,set of 2 ceramic painted hearts,96,2011-08-26 14:19:00,0.0,14646,Spain,0.0,0.0
223932,564651,23268,2011,8,5,14,set of 2 ceramic christmas reindeer,192,2011-08-26 14:19:00,0.0,14646,Spain,0.0,0.0
223933,564651,22955,2011,8,5,14,36 foil star cake cases,144,2011-08-26 14:19:00,0.0,14646,Spain,0.0,0.0
223934,564651,21786,2011,8,5,14,polkadot rain hat,144,2011-08-26 14:19:00,0.0,14646,Spain,0.0,0.0
256263,568158,PADS,2011,9,7,12,pads to match all cushions,1,2011-09-25 12:22:00,0.0,16133,Spain,0.0,0.0
259399,568384,M,2011,9,2,9,manual,1,2011-09-27 09:46:00,0.0,12748,Spain,0.0,0.0
273926,569716,22778,2011,10,4,8,glass cloche small,2,2011-10-06 08:17:00,0.0,15804,Spain,0.0,0.0
286507,571035,M,2011,10,4,12,manual,1,2011-10-13 12:50:00,0.0,12446,Spain,0.0,0.0
307092,572893,21208,2011,10,3,14,pastel colour honeycomb fan,5,2011-10-26 14:36:00,0.0,18059,Spain,0.0,0.0
319882,574138,23234,2011,11,4,11,biscuit tin vintage christmas,216,2011-11-03 11:26:00,0.0,12415,Spain,0.0,0.0
320049,574175,22065,2011,11,4,11,christmas pudding trinket pot,12,2011-11-03 11:47:00,0.0,14110,Spain,0.0,0.0
320407,574252,M,2011,11,4,13,manual,1,2011-11-03 13:24:00,0.0,12437,Spain,0.0,0.0
322279,574469,22385,2011,11,5,11,jumbo bag spaceboy design,12,2011-11-04 11:55:00,0.0,12431,Spain,0.0,0.0
328385,574879,22625,2011,11,1,13,red kitchen scales,2,2011-11-07 13:22:00,0.0,13014,Spain,0.0,0.0
329006,574920,22899,2011,11,1,16,children's apron dolly girl,1,2011-11-07 16:34:00,0.0,13985,Spain,0.0,0.0
329007,574920,23480,2011,11,1,16,mini lights woodland mushrooms,1,2011-11-07 16:34:00,0.0,13985,Spain,0.0,0.0
334242,575579,22437,2011,11,4,11,set of 9 black skull balloons,20,2011-11-10 11:49:00,0.0,13081,Spain,0.0,0.0
334243,575579,22089,2011,11,4,11,paper bunting vintage paisley,24,2011-11-10 11:49:00,0.0,13081,Spain,0.0,0.0
352746,577129,22464,2011,11,4,19,hanging metal heart lantern,4,2011-11-17 19:52:00,0.0,15602,Spain,0.0,0.0
353097,577168,M,2011,11,5,10,manual,1,2011-11-18 10:42:00,0.0,12603,Spain,0.0,0.0
354170,577314,23407,2011,11,5,13,set of 2 trays home sweet home,2,2011-11-18 13:23:00,0.0,12444,Spain,0.0,0.0
358629,577696,M,2011,11,1,11,manual,1,2011-11-21 11:57:00,0.0,16406,Spain,0.0,0.0
370473,578841,84826,2011,11,5,15,asstd design 3d paper stickers,12540,2011-11-25 15:57:00,0.0,13256,Spain,0.0,0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [295]:
# your code here
orders.filter(lambda x: x.startswith('lunch bag'),list(orders['Description']))

TypeError: Keyword arguments `items`, `like`, or `regex` are mutually exclusive

#### Select all `lunch bag` orders made in 2011.

In [0]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [0]:
# your code here

#### Select all orders made in the month of August.

In [0]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [0]:
# your code here

#### What's the  average amount of money spent by country?

In [0]:
# your code here

#### What's the most expensive item?

In [0]:
# your code here

#### What is the average amount spent per year?

In [0]:
# your code here